Revit 2027 API
AnalysisDisplayDiagramSettings.FenceType Property
 Type of diagram fence visualization.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayStyleDiagramFenceType FenceType { get; set; }
Public Property FenceType As AnalysisDisplayStyleDiagramFenceType
	Get
	Set
public:
property AnalysisDisplayStyleDiagramFenceType FenceType {
	AnalysisDisplayStyleDiagramFenceType get ();
	void set (AnalysisDisplayStyleDiagramFenceType value);
}
member FenceType : AnalysisDisplayStyleDiagramFenceType with get, set
Property Value
AnalysisDisplayStyleDiagramFenceType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AnalysisDisplayDiagramSettings Class
Autodesk.Revit.DB.Analysis Namespace